app/controllers/cms_controller.rb

  def index
    @homepage = Page.find_by_defaut("t");
    if @homepage.nil?
      @homepage = Page.take;
---
SELECT "pages".* FROM "pages" WHERE "pages"."defaut" = 1 LIMIT 1
SELECT "pages".* FROM "pages" ORDER BY "pages".updated_at DESC LIMIT 1