app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("content", "created_at", "defaut", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "MyText"], ["created_at", Wed, 13 Aug 2014 01:41:42 UTC +00:00], ["defaut", false], ["location", false], ["title", "MyString"], ["updated_at", Wed, 13 Aug 2014 01:41:42 UTC +00:00]]

  def update
    respond_to do |format|
      if @page.update(page_params)
---
UPDATE "pages" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "pages"."id" = 980190962  [["title", "Lorem Ipsum"], ["content", "Wibbles are fun!"], ["updated_at", Wed, 13 Aug 2014 02:41:05 UTC +00:00]]

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 980190962]]

  def display
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "3"]]