app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users".name ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 27 Aug 2014 03:41:46 UTC +00:00], ["name", "sam"], ["password", "secret"], ["updated_at", Wed, 27 Aug 2014 03:41:46 UTC +00:00]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = 980190962  [["password", "secret"], ["updated_at", Wed, 27 Aug 2014 05:27:08 UTC +00:00]]